
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

// Находит транспортное средство по гос. номеру и марке.
//
// Параметры:
//  Параметры - Структура - Параметры для поиска транспортного средства.
//   * ГосНомер - Строка - Гос. номер транспортного средства.
//   * Марка - Строка - Марка транспортного средства.
//
// Возвращаемое значение:
//  СправочникСсылка.ТранспортныеСредства - Найденное транспортное средство или Неопределено, если не найдено.
//
Функция НайтиТранспортноеСредство(Параметры)
	запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТранспортныеСредства.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ТранспортныеСредства КАК ТранспортныеСредства
	               |ГДЕ
	               |	ТранспортныеСредства.ГосНомер = &ГосНомер
	               |	И ТранспортныеСредства.Марка = &Марка";
	Запрос.УстановитьПараметр("ГосНомер", Параметры.ГосНомер);
	Запрос.УстановитьПараметр("Марка", Параметры.Марка);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Ссылка;
		
КонецФункции

Функция ОпределитьОперациюПоучетутоваров(Параметры)
	запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОперацииПоУчетуТоваров.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ОперацииПоУчетуТоваров КАК ОперацииПоУчетуТоваров
	               |ГДЕ
	               |	ОперацииПоУчетуТоваров.ВидОперации = &ВидОперации
	               |	И ОперацииПоУчетуТоваров.Организация
	               |	И ОперацииПоУчетуТоваров.Склад = &Склад
	               |	И ОперацииПоУчетуТоваров.ТранспортноеСредство = &ТранспортноеСредство";
	Запрос.УстановитьПараметр("ВидОперации", Параметры.ВидОперации);
	Запрос.УстановитьПараметр("Склад", Параметры.Склад);
									
	
КонецФункции